<?php
//Точка входу
session_start();

//Якщо в процесі сесії імя користувача не встановлено, пробуємо його азяти з кук
if(!isset($_SESSION['username']) && isset($_COOKIE['username']))
$_SESSION['username'] = $_COOKIE['username'];

//Ще раз шукаємо користувача в сесії
$username = $_SESSION['username'];

//Не авторизованих користувачів відправляємо на сторінку авторизації
if ($username == Null) {
    header("Location: open.php"); //Адрес головної сторінки
    }

/* Подключаем файл для получения соединения к базе данных (PhpMyAdmin, MySQL) */
require_once 'config/connect.php';
?>

<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Головна</title>
</head>
<style>
/*Налаштовуємо меню*/
.menu {
    width: 100%;
    display: table;
}
.menu ul {
    display: table-row;
}
.menu li {
    display: table-cell;
    position: relative;
    background: black;
}
.menu li a {
    display: block;
    padding: 15px 15px;
    color: #fff;
    text-align: center;
}
.menu-caret:after {
    display: inline-block;
    width: 0;
    height: 0;
    margin-left: .255em;
    vertical-align: .255em;
    content: "";
    border-top: 3px solid;
    border-right: 3px solid transparent;
    border-bottom: 0;
    border-left: 3px solid transparent;
}
.menu ul li:hover, .menu a:hover {
    background: #666;
}
.menu li:hover ul  {
    display: block;
    position: absolute;
    top: 100%;
    left: 0px;
    background: #666;
    margin: 0;
    padding: 10px 20px;
    width: avto;
    z-index: 9999;
}
.menu ul ul  {
    display: none;
}
.menu ul ul li  {
    display: block;
    background: #666;
    padding: 5px 0;
}
.menu ul ul li a  {
    display: block;
    padding: 0;
    background: #666;
    text-align: left;
}
body { background: url(img/depositphotos_91192242-stock-illustration-seamless-pattern-with-blue-petals.jpg); }


.product img {
    width: 100%;}

.product-bottom p {
    font-size: 18px; /*Розмір шришта*/
    font-family: 'Arial';  /*Вид шришта*/
    font-weight: 600; /*Встановлює насиченість шрифту*/
    font-variant: all-petite-caps;} /*Визначає, як потрібно представляти букви*/

.product-price { color: brown;}

.product-text-title {color: black;}

/*Кнопка*/
.btn-buy{
    background: yellow;
    color: green;
    font-size: 15px;
    padding: 0 30px;
    height: 40px;
    outline: none; /*Універсальна властивість, що одночасно встановлює колір, стиль та товщину зовнішньої межі на всіх чотирьох сторонах елемента*/
    border-radius: 7px;
    cursor: pointer; /*Встановлює форму курсора*/
    margin-left: 80px;}

/*клас для тексту*/
.text{
    height: avto;
    width: 1000px;}

/*клас для логотипу сайту - зображення*/
.product_img{
    height: avto;
    width: 100px;}

/*клас для логотипу сайту - текст*/
.product_text{
     font-size: 33px;
    font-family: 'cursive;';
     color: black;}
h2{
    font-size: 26px;
    box-shadow: rgba(0, 0, 0, 0.35) 0px 5px 5px; /*Додає тінь до елемента*/
    background: #ff00ff;
    border-radius: 7px;
}
h4{
    font-size: 22px;
    color: #f737d0;
}
h3{
    font-size: 20px;
    text-indent: 40px;
    font-family: 'Arial';
}
a{
    color: blue;
}
.topNubex {
    position: fixed;
    right: 15px;
    bottom: 15px;
    background: white ;
    color:  #f737d0;
    text-decoration-color: blue;
    font-size: 18pt;
    border: 2px solid; /*границі вікна*/
    border-radius: 5px;
    padding: 0 30px;
   }
.topNubexq {
    position: fixed;
    right: 15px;
    bottom: 50px;
    background: white ;
    color:  #f737d0;
    text-decoration-color: blue;
    font-size: 18pt;
    border: 2px solid; /*границі вікна*/
    border-radius: 5px;
    padding: 0 30px;
   }
    .vis{
  background: linear-gradient(to right, #ffffff 0%, #99ff33 104%);
    border-radius: 10px;
    border: 2px solid black;
    padding: 0 50px;
    max-width: 1200px;
    margin-left: auto;
    margin-right: auto
}
</style>


<body>
    <!-- Виведення шапки сайту -->
     <p class='product_text' align="center" ><img  class = "product_img" src='img/png-transparent-computer-icons-magazine-windows-95-icon-logo-sign-signage.png' >Головний кабінет класного керівника </p>
     <p >Ви ввійшли як <b>"<?php echo $username; ?>"</b>  <a href="open.php">Вихід</a></p>

    <!-- Виведення меню сайту  -->
       <div class="menu">
    <ul>
        <li><a href="index.php">Главная</a></li>
        <li><a href="open.php">Авторизація</a></li>
        <li>
            <a class="menu-caret" href="#">Розділи</a>
            <ul>
                <li><a href="/2.php">2. Відомості про студентів</a></li>
                <li><a href="/3.php">3. Відвідування та успішність студентів</a></li>
                <li><a href="/5.php">5. Помітки керівника групи про індивідуальну роботу з студентами</a></li>
                <li><a href="/7.php">7. План роботи керівника на семестр навчального року</a></li>
            </ul>
        </li>
        <li><a href="help.php">Допомога</a></li>
        <li><a href="comentar.php">Коментарі</a></li>
    </ul>
</div>
<a href="#" class="topNubexq">Вверх</a>
<a href="#top" class="topNubex">Вниз </a>
     <div class="vis"><h2 align="center">!! Увага !!</h2><h3 ><br>Всі табиці які веде класний керівник в будь який час може перевірити Адміністратор сайту, і в залежності як виконується робота , надіслати йому коментар, він знаходиться за <a href="comentar.php"> посиланням </a></h3></div>

    <div class="vis"><h2 align="center">!! Зміст сторінки !!</h2><h4 align="center" >
        <br><a href="#gov">Головна сторінка</a><br>
        <a href="#com">Коментарі</a><br>
        <a href="#roz">Заповнення розділів</a><br>
        <a href="#roz2">2 розділ</a><br>
        <a href="#roz3">3 розділ</a><br>
        <a href="#roz5">5 розділ</a><br>
        <a href="#roz7">7 розділ</a><br><br>
    </h4></div>
    <div class="vis"><a name="gov"></a><h2 align="center" >Головна сторінка</h2><h3>На сторінці <a href="index.php"> "Головна" </a> розміщено привітання системи з керівником, відразу після його авторизації, і сьогоднішня дата. Також тут єсть зобращення коледжу і для дисципліни при вході в систему вас лічно вітає Поставний І.М.</h3><h3> Якщо у користувача наявні нові коментарі від адміністратора(тобто ще не прочитані). То сторінка сайту відразу повідоме керівника групи, повідомленням <a href="comentar.php"> "!!Наявні нові коментарі!!" </a>. і натиснувши на це посилання у класного керівника є можливість відразу їх <a href="#com"> переглянути </a>.</h3><h3> Також Якщо у керівника єсть щей не виконані плани, то система його також відразу попередить повідобленням <a href="7.php"> "!!Невиконані плани!!" </a> і при натисканні на це посилання відкриється сторінка сайту "Розділ 7", де буде можливіть переглянути і виконати, тобто система автоматично буде попереджувати керівника щоб він виконував свою роботу вчасно і якісно.<h3></div>
    <div class="vis"><a name="com"></a><h2 align="center" >Коментарі</h2><h3>На сторінці <a href="comentar.php"> "Коментарі" </a> розміщені коментарі які написав Поставний І.М., при перегляді звіту роботи класного керівника.</h3><h3> Якщо у користувача наявні нові коментарі, то його статус буде "Новий", і внизу після тексту коментаря, буде кнопка "Прочитаний", яка змінює його Статус відповідно на "Причитаний".</h3><h3> Також коли адміністратор переглядатими звіт роботи керівника ще раз, тільки він зможе видалити коментар, попередньо переконавшись що він уже виконанний.</h3></div>




    <a name="roz"></a><h1 align="center">Заповнення розділів</h1>
    <div class="vis"> <a name="roz2"></a><h2 align="center" >2 розділ</h2><h4 align="center" >Загальна інформація</h4>
    <h3>В <a href="2.php"> даному розділу </a> розміщені студенти групи. Також  є можливість: <br>
        1) Додати студента в систему;<br>
        2) Видалення студента з системи;<br>
        3) Перегляд інформації про студента;<br>
        4) Зателефонувати студенту.</h3>
    <h4 align="center" >1. Додавання студента в систему</h4>
    <h3>Для додавання студента в табицю потрібно:<br>
    1) Натиснути кнопку "Додати нового студента";<br>
    2) Потім у <a href="new_student.php"> відкритому вікні </a> завантажити зображення студента, і ввести всі дані про нього в базу сайта;<br>
    3) натиснути кнопку "Добавити студента", відбудеться перехід у <a href="2.php"> 2 розділ сайту </a>, там вже буде відображений, щойно добавлений студент групи.</h3>
    <h4 align="center" >2. Видалення студента з системи</h4>
    <h3>Для Видалення студента потрібно натиснути посилання "Видалити", воно виділене червоним кольором, навпроти того студента який вам не потрібний</h3>
    <h4 align="center" >3. Перегляд інформації про студента</h4>
    <h3>Для Перегляду потрібно натиснути кнопку "Переглянути", вона зображена жовтим кольором кольором, навпроти того студента який вам потрібний</h3>
    <h4 align="center" >4. Телефоний дзвінок</h4>
    <h3>Для виконання телефонного дзвінка вам   потрібно натиснути на телефон, наприклад "+380999999999", воно виділене синім кольором, навпроти того студента який вам  потрібний</h3></div>
    <div class="vis"> <a name="roz3"></a><h2 align="center" >3 розділ</h2><h4 align="center" >Загальна інформація</h4>
    <h3>В <a href="3.php"> даному розділу </a> розміщені графіки відвідування та успішності студентів. Також  є можливість: <br>
        1) Створити новий графік(одноразово);<br>
        2) Завантажити графік в систему;<br>
        3) Перегляд графіка.</h3>
    <h4 align="center">1. Створення нового графіка</h4>
    <h3>Якщо класний керівник, тільки но хоче завантажити перший графік, йому потрібно:<br>
        1) Натиснути кнопку "Створити новий графік";<br>
        2) Навпроти потрібного семестру і вида графіка(тобто успішність або відвідування), натиснути кнопку "Выбрати файлы";<br>
        3)Вибрати потрібний файл для завантаження його в систему;<br>
        4)Натиснути кнопку фіолетового кольору "Завантажити".
    <h4 align="center">2. Завантаження потрібного графіка</h4>
    <h3>Для завантаження графіка потрібно:<br>
    1) Натиснути кнопку сірого кольору "Выбрать файлы";<br>
    2) У вікні що відкриється вибрати потрібне зображення;<br>
    3) Натистути кнопку "Завантажити", на сторінці сайту.</h3>
    <h4 align="center">3. Перегляд завантаженого графіка</h4>
    <h3>Для перегляду вже завантажених графіків, потрібно натиснувши кнопку "Переглянути". Також при перегляді графіку є можливість закрити вікно перегляду графіка, кнопкою "Назад", яка розміщена внизу.</h3></div>
    <div class="vis"><a name="roz5"></a><h2 align="center">5 розділ</h2><h4 align="center" >Загальна інформація</h4>
    <h3>В <a href="5.php"> даному розділу </a> розміщені помітки класного керівника групи про індивідуальну роботу в групі. Тут керівку потрібно по мірі проведення індивідуальної роботи в групі, додавати нові записи в таблицю</h3>
    <h4 align="center" >Додавання нового запису</h4>
    <h3>Для додавання нової помітки потрібно:<br>
    1) Натиснути кнопку "Добавити новий запис";<br>
    2) У відкритому вікні ввести дату, опис проведеної роботи, і видільти студентів з ким бул проведена індивідуальна робота(виділяти декількох студентів потрібно натиснувши клавішу  "Ctrl");<br>
    3) Натискаємо на кнопку "Добавити запис".</h3></div>
    <div class="vis"><a name="roz7"></a><h2 align="center">7 розділ</h2><h4 align="center" >Загальна інформація</h4>
    <h3>В <a href="7.php"> даному розділу </a> розміщений план роботи керівника на семестр навчального року. Тут керівку потрібно заповнити таблицю записами плану, і по мірі його виконання ставити голочку та натискати кнопку "Ок", щоб план позначався в системі як "Виконаний"</h3>
    <h4 align="center" >Додавання нового запису</h4>
    <h3>Для додавання нового етапу плану потрібно:<br>
    1) Натиснути кнопку "Добавити новий запис";<br>
    2) У відкритому вікні ввести дату, дані роботи,<br>
    3) Натискаємо на кнопку "Добавити запис".</h3></div>
<a name="top"></a>
</body>
</html>

